In [29]:
import pandas as pd
import numpy as np

In [54]:
a={'name':['keerthi','siri','haritha','stephi','ramya','devi','deepika'],'rollno':[511,522,541,556,539,541,530],'place':['tpk','mnp','pkl','jgg','gnv','mrt','egt'],'age':[20,20,21,20,20,21,21]}
a=pd.DataFrame(a)

In [55]:
a

      name  rollno place  age
0  keerthi     511   tpk   20
1     siri     522   mnp   20
2  haritha     541   pkl   21
3   stephi     556   jgg   20
4    ramya     539   gnv   20
5     devi     541   mrt   21
6  deepika     530   egt   21

In [68]:
a.loc[2,'place']=np.nan
a

      name  rollno place  age
0  keerthi     511   tpk   20
1     siri     522   mnp   20
2  haritha     541   NaN   21
3   stephi     556   jgg   20
4    ramya     539   gnv   20
5     devi     541   mrt   21
6  deepika     530   egt   21

In [69]:
a.isna().sum()

name      0
rollno    0
place     1
age       0
dtype: int64

In [70]:
a.isnull().sum()

name      0
rollno    0
place     1
age       0
dtype: int64

In [71]:
a.reindex([0,2,4,6,1,3,5])

      name  rollno place  age
0  keerthi     511   tpk   20
2  haritha     541   NaN   21
4    ramya     539   gnv   20
6  deepika     530   egt   21
1     siri     522   mnp   20
3   stephi     556   jgg   20
5     devi     541   mrt   21

In [72]:
a.age[:]>20

0    False
1    False
2     True
3    False
4    False
5     True
6     True
Name: age, dtype: bool

In [73]:
a

      name  rollno place  age
0  keerthi     511   tpk   20
1     siri     522   mnp   20
2  haritha     541   NaN   21
3   stephi     556   jgg   20
4    ramya     539   gnv   20
5     devi     541   mrt   21
6  deepika     530   egt   21

In [74]:
a.iloc[:,:][a.age<21]

      name  rollno place  age
0  keerthi     511   tpk   20
1     siri     522   mnp   20
3   stephi     556   jgg   20
4    ramya     539   gnv   20

In [75]:
b={'name':['abc','cde','ngdgd','amfmf','erff','jhggh','ggvhjl'],'rollno':[511,522,541,556,539,541,530],'place':['tpk','mnp','pkl','jgg','gnv','mrt','egt'],'age':[20,20,21,20,20,21,21]}
b=pd.DataFrame(b)

In [76]:
b

     name  rollno place  age
0     abc     511   tpk   20
1     cde     522   mnp   20
2   ngdgd     541   pkl   21
3   amfmf     556   jgg   20
4    erff     539   gnv   20
5   jhggh     541   mrt   21
6  ggvhjl     530   egt   21

In [82]:
c=a + b
c

            name  rollno   place  age
0     keerthiabc    1022  tpktpk   40
1        siricde    1044  mnpmnp   40
2   harithangdgd    1082     NaN   42
3    stephiamfmf    1112  jggjgg   40
4      ramyaerff    1078  gnvgnv   40
5      devijhggh    1082  mrtmrt   42
6  deepikaggvhjl    1060  egtegt   42

In [83]:
c['total']=c.age

In [84]:
c

            name  rollno   place  age  total
0     keerthiabc    1022  tpktpk   40     40
1        siricde    1044  mnpmnp   40     40
2   harithangdgd    1082     NaN   42     42
3    stephiamfmf    1112  jggjgg   40     40
4      ramyaerff    1078  gnvgnv   40     40
5      devijhggh    1082  mrtmrt   42     42
6  deepikaggvhjl    1060  egtegt   42     42

In [111]:
df1=pd.DataFrame(np.arange(12).reshape(3,4),columns=list('badc'))
df1

   b  a   d   c
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [97]:
a.dtypes

name      object
rollno     int64
place     object
age        int64
dtype: object

In [101]:
df2=pd.DataFrame(np.arange(20).reshape(4,5),columns=list('abcde'))

In [102]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [103]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [104]:
df1.add(df2)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [105]:
df1.add(df2,fill_value=1)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   5.0
1   9.0  11.0  13.0  15.0  10.0
2  18.0  20.0  22.0  24.0  15.0
3  16.0  17.0  18.0  19.0  20.0

In [106]:
a

      name  rollno place  age
0  keerthi     511   tpk   20
1     siri     522   mnp   20
2  haritha     541   NaN   21
3   stephi     556   jgg   20
4    ramya     539   gnv   20
5     devi     541   mrt   21
6  deepika     530   egt   21

In [107]:
a.fillna(method='ffill',axis=0)

      name  rollno place  age
0  keerthi     511   tpk   20
1     siri     522   mnp   20
2  haritha     541   mnp   21
3   stephi     556   jgg   20
4    ramya     539   gnv   20
5     devi     541   mrt   21
6  deepika     530   egt   21

In [108]:
df1.replace({0:10,2:10})

    a  b   c   d
0  10  1  10   3
1   4  5   6   7
2   8  9  10  11

In [109]:
df1.replace([1,2,3],4)

   a  b   c   d
0  0  4   4   4
1  4  5   6   7
2  8  9  10  11

In [112]:
df1

   b  a   d   c
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [113]:
df1.sort_index(axis=1)

   a  b   c   d
0  1  0   3   2
1  5  4   7   6
2  9  8  11  10

In [114]:
df2['rank']=df2['e'].rank()

In [115]:
df2

    a   b   c   d   e  rank
0   0   1   2   3   4   1.0
1   5   6   7   8   9   2.0
2  10  11  12  13  14   3.0
3  15  16  17  18  19   4.0

In [116]:
df2['rank']=df2['e'].rank(method="max")

In [117]:
df2

    a   b   c   d   e  rank
0   0   1   2   3   4   1.0
1   5   6   7   8   9   2.0
2  10  11  12  13  14   3.0
3  15  16  17  18  19   4.0

In [119]:
df1=pd.DataFrame({'id':[1,2,3,4,5],'grade':['a','b','e','d','b']})

In [128]:
df1["Grade"] = df1["grade"].astype('category')
df1['Grade'].cat.categories=['very good','good','bad','very bad']

In [129]:
df1

   id grade      Grade
0   1     a  very good
1   2     b       good
2   3     e   very bad
3   4     d        bad
4   5     b       good